--- a/wiki/index.md
+++ b/wiki/index.md
@@ -88,17 +102,16 @@ Developers can identify this information easily from the documentation of the we
 
 For `facebook` example, we can assume DAG will look like this. 
 
-```mermaid
-flowchart TD
+```d2
+      fbUser: fbUser API 
+      fbPost: fbPost API 
+      fbComment: fbComment API 
+      fbCommunity: fbCommunity API 
 
-      A["fbUser"]
-      B["fbCommunity"]
-      C["fbPost"]
-      D["fbComment"]
 
-      A --> B
-      A --> C
-      C --> D
+      fbUser --> fbPost
+      fbPost --> fbComment
+      fbUser --> fbCommunity
 
 ```
 
